# Taps
tap 'exolnet/homebrew-deprecated'
tap 'homebrew/cask-fonts'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnu-sed'
brew 'grep'
brew 'hub'
brew 'tmux'

# Development
brew 'composer'
brew 'dnsmasq'
brew 'imagemagick'
brew 'Schniz/tap/fnm'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'php'
brew 'php@5.6'
brew 'php@7.0'
brew 'php@7.1'
brew 'php@7.2'
brew 'php@7.3'
brew 'yarn'

# Apps
cask 'alfred'
cask 'dashlane'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'phpstorm'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'splashtop-business'
cask 'table-tool'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-consolas'